<?php
$msg = "";
$success = true;
$mailMsg = "";

if (isset($_POST['submit'])) {
    $mailMsg .= '<h2>Запитване от сайта</h2>';
    $mailMsg .= '<p>Име: ' . $_POST['name'] . '</p>';
    $mailMsg .= '<p>Имейл: ' . $_POST['email'] . '</p>';
    $mailMsg .= '<p>Описание: ' . $_POST['message'] . '</p>';
    $subject = 'Запитване от сайта';
    if(sendMail($mail, $adminEmail, $subject, $mailMsg, strip_tags($mailMsg))){
        $msg = "Получихме вашата заявка. Ще се свържем с вас възможно най-скоро";
    } else {
        $msg = "Нещо се обърка. Моля свържете се с администратор";
        $success = false;
    }
}
?>

<?php
    if(isMobile()){
?>
<section>
		<div class="container mt-5 mb-3">
			<div class="row">
				<div class="col-12 user-reg-w">
					<div class="row mb-2">
						<div class="col-12 text-center ff-rb mb-1">
							<h3>Контакти</h3>
						</div>
						<div class="col-12 text-center ff-rl">
							За всякакви въпроси и мнения, моля, попълнете формата по-долу.
						</div>
					</div>
					<div class="row form-w">
					    <form method="POST" action="<?= $core ?>contact">
						<div class="col-12 mb-1">
							<input type="text" name="name" placeholder="Вашето Име">
						</div>
						<div class="col-12 mb-1">
							<input type="text"  name="email" placeholder="E-Mail Адрес">
						</div>
						<div class="col-12 mb-1">
							<textarea rows="15"  name="message" cols="50" placeholder="Запитване"></textarea>
						</div>
						<div class="col-12 mb-2">
							<div class="form-check form-check-inline">
								<input class="form-check-input" type="checkbox" name="checkbox1" id="checkbox1-1"   onchange="document.getElementById('submit').disabled = !this.checked">
								<label class="form-check-label input-checkbox-label" for="checkbox1-1">
									Съгласявам се с Политиката за поверителност.
								</label>
							</div>
						</div>
						<div class="col-12 mb-1">
							<button class="btn w-100" name="submit" id="submit" disabled onclick="this.innerHTML='Изпращане...'">Изпрати</button>
						</div>
						</form>
					</div>
				</div>
			</div>
		</div>
	</section>

	<section class="section mt-3 py-2 bg-gblue">
		<div class="container">
			<div class="row">
				<div class="col-12 mb-1 text-center clr-db">
					<div class="row">
						<div class="col-12 text-center clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-368 -958)"><circle cx="25" cy="25" r="25" transform="translate(368 958)" fill="#07abf3"/><g transform="translate(372 963.387)"><path d="M21.491,5a12.491,12.491,0,0,0-9.244,20.892L20.9,35.955a.781.781,0,0,0,1.187,0l8.65-10.063A12.491,12.491,0,0,0,21.491,5Zm8.057,19.877-8.057,9.376-8.057-9.369a10.93,10.93,0,1,1,16.114,0Z" transform="translate(0 0)" fill="#fff"/><path d="M23.465,14a5.465,5.465,0,1,0,5.465,5.465A5.465,5.465,0,0,0,23.465,14Zm0,9.369a3.9,3.9,0,1,1,3.9-3.9,3.9,3.9,0,0,1-3.9,3.9Z" transform="translate(-1.974 -1.974)" fill="#fff"/></g></g></svg>
							</div>
						</div>
						<div class="col-12 text-center clr-db">
							<p class="ff-rb text-uppercase fz-18x">Адрес</p>
							<p class="ff-rl">Град,</p>
							<p class="ff-rl">Адрес</p>
						</div>
					</div>
				</div>
				<div class="col-12 mb-1 text-center clr-db">
					<div class="row">
						<div class="col-12 text-center clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-759 -947)"><circle cx="25" cy="25" r="25" transform="translate(759 947)" fill="#07abf3"/><g transform="translate(768.066 956)"><path d="M23.45,20.93a3,3,0,0,0-4.25,0l-1.45,1.45a26.14,26.14,0,0,1-4.51-3.62,26.62,26.62,0,0,1-3.62-4.51l1.45-1.45a3,3,0,0,0,0-4.25L8.24,5.73a2.93,2.93,0,0,0-2.11-.88A3,3,0,0,0,4,5.73L2.64,7.08A6.37,6.37,0,0,0,1,12.33c.32,3.75,2.78,8.26,6.57,12.06s8.35,6.25,12.1,6.61a7.87,7.87,0,0,0,.84,0,6.07,6.07,0,0,0,4.41-1.64L26.27,28a3,3,0,0,0,.88-2.13,2.93,2.93,0,0,0-.88-2.11Zm1.41,5.66L23.5,27.94a4.57,4.57,0,0,1-3.66,1c-3.25-.28-7.39-2.58-10.81-6S3.31,15.41,3,12.16A4.53,4.53,0,0,1,4,8.5L5.41,7.14a1.014,1.014,0,0,1,1.42,0L9.66,10a1,1,0,0,1,0,1.41l-2,2a1,1,0,0,0-.16,1.21,27.49,27.49,0,0,0,4.33,5.58,27.49,27.49,0,0,0,5.58,4.33,1,1,0,0,0,1.21-.16l2-2a1,1,0,0,1,1.41,0l2.83,2.83a.978.978,0,0,1,0,1.39Z" fill="#fff"/><path d="M20.09,31.261c-.144,0-.29,0-.433-.012h-.011c-3.87-.372-8.45-2.87-12.253-6.682C3.561,20.725,1.079,16.161.752,12.359A6.59,6.59,0,0,1,2.457,6.91L2.464,6.9l1.36-1.35a3.228,3.228,0,0,1,2.3-.953h.024a3.2,3.2,0,0,1,2.272.955l2.828,2.818a3.25,3.25,0,0,1,0,4.6L9.939,14.284a26.417,26.417,0,0,0,3.478,4.3,25.937,25.937,0,0,0,4.3,3.478l1.308-1.308a3.25,3.25,0,0,1,4.6,0l2.82,2.83a3.2,3.2,0,0,1,.953,2.288,3.27,3.27,0,0,1-.953,2.305l-1.356,1.365a6.3,6.3,0,0,1-4.326,1.713c-.085,0-.169,0-.254-.005C20.372,31.258,20.23,31.261,20.09,31.261Zm-.4-.511a7.662,7.662,0,0,0,.808,0h.024c.081,0,.163.005.244.005a5.8,5.8,0,0,0,3.981-1.575l1.347-1.357a2.769,2.769,0,0,0,.807-1.953,2.7,2.7,0,0,0-.8-1.932l-2.822-2.832a2.75,2.75,0,0,0-3.9,0L17.785,22.7l-.169-.107a26.433,26.433,0,0,1-4.553-3.655,26.914,26.914,0,0,1-3.654-4.552L9.3,14.215l1.592-1.592a2.75,2.75,0,0,0,0-3.9l-2.83-2.82A2.7,2.7,0,0,0,6.147,5.1H6.123a2.732,2.732,0,0,0-1.946.807L2.82,7.254a6.093,6.093,0,0,0-1.572,5.04l0,.015c.315,3.691,2.744,8.141,6.5,11.9C11.469,27.945,15.932,30.388,19.689,30.751Zm.885-1.5a4.835,4.835,0,0,1-.765-.061c-3.3-.288-7.5-2.614-10.956-6.071s-5.784-7.632-6.1-10.924A4.773,4.773,0,0,1,3.809,8.339l.018-.019,1.41-1.36a1.24,1.24,0,0,1,.878-.36h.012a1.242,1.242,0,0,1,.88.363L9.838,9.824a1.253,1.253,0,0,1,0,1.762l-2,2a.751.751,0,0,0-.12.908,27.251,27.251,0,0,0,4.29,5.528,27.257,27.257,0,0,0,5.53,4.292.75.75,0,0,0,.906-.121l2-2a1.25,1.25,0,0,1,1.763,0l2.831,2.831a1.228,1.228,0,0,1,0,1.743L23.66,28.132A4.829,4.829,0,0,1,20.574,29.249ZM4.183,8.671a4.274,4.274,0,0,0-.937,3.448l0,.017c.3,3.184,2.587,7.256,5.958,10.627s7.464,5.653,10.655,5.928l.019,0a4.319,4.319,0,0,0,3.452-.938l1.352-1.342a.728.728,0,0,0,0-1.037l-2.829-2.829a.75.75,0,0,0-1.057,0l-2,2a1.25,1.25,0,0,1-1.512.2,27.757,27.757,0,0,1-5.632-4.37,27.751,27.751,0,0,1-4.368-5.63,1.251,1.251,0,0,1,.2-1.514l2-2a.752.752,0,0,0,0-1.057l-2.83-2.86A.744.744,0,0,0,6.126,7.1H6.114a.745.745,0,0,0-.528.218Z" fill="#07abf3"/><path d="M26.6,5.39A14.92,14.92,0,0,0,16,1a1,1,0,0,0,0,2A13,13,0,0,1,29,16.11a1,1,0,1,0,2,0A14.91,14.91,0,0,0,26.6,5.39Z" fill="#fff"/><path d="M16.03.75A15.23,15.23,0,0,1,31.25,16.112a1.25,1.25,0,0,1-2.5,0A12.75,12.75,0,0,0,16,3.25a1.25,1.25,0,1,1,0-2.5ZM30,16.86a.751.751,0,0,0,.75-.75A14.756,14.756,0,0,0,16.03,1.25H16a.75.75,0,1,0,0,1.5A13.25,13.25,0,0,1,29.25,16.112.75.75,0,0,0,30,16.86Z" fill="#07abf3"/><path d="M20.91,11.11a6,6,0,0,1,1.77,4.31,1,1,0,0,0,2,0,8,8,0,0,0-8-8.1,1,1,0,0,0,0,2,6,6,0,0,1,4.23,1.79Z" fill="#fff"/><path d="M16.68,7.07h0a8.25,8.25,0,0,1,8.25,8.353,1.25,1.25,0,0,1-2.5,0,5.784,5.784,0,0,0-1.7-4.133A5.714,5.714,0,0,0,16.678,9.57a1.25,1.25,0,0,1,0-2.5Zm7,9.1a.751.751,0,0,0,.75-.75,7.75,7.75,0,0,0-7.75-7.85h0a.75.75,0,1,0,0,1.5,6.21,6.21,0,0,1,4.408,1.865,6.284,6.284,0,0,1,1.842,4.488A.75.75,0,0,0,23.68,16.17Z" fill="#07abf3"/></g></g></svg>
							</div>
						</div>
						<div class="col-12 text-center clr-db">
							<p class="ff-rb text-uppercase fz-18x">Телефон</p>
							<p class="ff-rl">+359 123 456</p>
							<p class="ff-rl">+359 123 457</p>
						</div>
					</div>
				</div>
				<div class="col-12 mb-1 text-center clr-db">
					<div class="row">
						<div class="col-12 text-center clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-1058 -947)"><circle cx="25" cy="25" r="25" transform="translate(1058 947)" fill="#07abf3"/><g transform="translate(1069 961)"><path d="M25.451,61h-23A2.457,2.457,0,0,0,0,63.452V79.8a2.456,2.456,0,0,0,2.452,2.452h23A2.456,2.456,0,0,0,27.9,79.8V63.452A2.456,2.456,0,0,0,25.451,61Zm-.339,1.635L14,73.744,2.8,62.635ZM1.635,79.464V63.783L9.509,71.59ZM2.791,80.62l7.879-7.879,2.761,2.737a.817.817,0,0,0,1.154,0l2.692-2.692,7.836,7.836Zm23.478-1.156-7.836-7.836,7.836-7.836Z" transform="translate(0 -61)" fill="#fff"/></g></g></svg>
							</div>
						</div>
						<div class="col-12 text-center clr-db">
							<p class="ff-rb text-uppercase fz-18x">Имейл</p>
							<p class="ff-rl">email@email.com</p>
							<p class="ff-rl">admin@email.bg</p>
						</div>
					</div>
				</div>
			</div>
		</div>
	</section>
<?php
} else {
?>
  <section>
		<div class="container my-3">
			<div class="row">
				<div class="col-12 user-reg-w">
                            <?=
                            ($msg != "") ? ('<div class="alert alert-' . (($success) ? "success" : "danger") . ' alert-dismissible fade show" role="alert">' . $msg . '<button type="button" class="close" data-dismiss="alert" aria-label="Close"><span aria-hidden="true">&times;</span></button></div>') : ("")
                            ?>				    
					<div class="row mb-2">
						<div class="col-12 text-center ff-rb mb-1">
							<h3>Контакти</h3>
						</div>
						<div class="col-12 text-center ff-rl">
							За всякакви въпроси и мнения, моля, попълнете формата по-долу.
						</div>
					</div>
					<form method="POST" action="<?= $core ?>contact">
						<div class="row mb-2 form-w">
								<div class="col-12 mb-1">
									<input type="text" name="name" placeholder="Вашето Име" required>
								</div>
								<div class="col-12 mb-1">
									<input type="text" name="email" placeholder="E-Mail Адрес" required>
								</div>
								<div class="col-12 mb-1">
									<textarea rows="15" name="message" cols="50" placeholder="Запитване" required></textarea>
								</div>
								<div class="col-12 mb-2">
									<div class="form-check form-check-inline">
										<input class="form-check-input" type="checkbox" name="checkbox1" id="checkbox1-1"  onchange="document.getElementById('submit').disabled = !this.checked">
										<label class="form-check-label input-checkbox-label" for="checkbox1-1">
											Съгласявам се с Политиката за поверителност.
										</label>
									</div>
								</div>
								<div class="col-12 mb-1">
									<button name="submit" id="submit" class="btn w-100" disabled onclick="this.innerHTML='Изпращане...'">Изпрати</button>
								</div>
						</div>
					</form>
				</div>
			</div>
		</div>
	</section>

	<section class="section mt-3 py-2 bg-gblue">
		<div class="container">
			<div class="row">
				<div class="col-md-4 col-12 text-center clr-db">
					<div class="row">
						<div class="col-5 text-right pr-0 clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-368 -958)"><circle cx="25" cy="25" r="25" transform="translate(368 958)" fill="#07abf3"/><g transform="translate(372 963.387)"><path d="M21.491,5a12.491,12.491,0,0,0-9.244,20.892L20.9,35.955a.781.781,0,0,0,1.187,0l8.65-10.063A12.491,12.491,0,0,0,21.491,5Zm8.057,19.877-8.057,9.376-8.057-9.369a10.93,10.93,0,1,1,16.114,0Z" transform="translate(0 0)" fill="#fff"/><path d="M23.465,14a5.465,5.465,0,1,0,5.465,5.465A5.465,5.465,0,0,0,23.465,14Zm0,9.369a3.9,3.9,0,1,1,3.9-3.9,3.9,3.9,0,0,1-3.9,3.9Z" transform="translate(-1.974 -1.974)" fill="#fff"/></g></g></svg>
							</div>
						</div>
						<div class="col-7 text-left clr-db">
							<p class="ff-rb text-uppercase fz-18x">Адрес</p>
							<p class="ff-rl">Град</p>
							<p class="ff-rl">Адрес</p>
						</div>
					</div>
				</div>
				<div class="col-md-4 col-12 text-center clr-db">
					<div class="row">
						<div class="col-5 text-right pr-0 clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-759 -947)"><circle cx="25" cy="25" r="25" transform="translate(759 947)" fill="#07abf3"/><g transform="translate(768.066 956)"><path d="M23.45,20.93a3,3,0,0,0-4.25,0l-1.45,1.45a26.14,26.14,0,0,1-4.51-3.62,26.62,26.62,0,0,1-3.62-4.51l1.45-1.45a3,3,0,0,0,0-4.25L8.24,5.73a2.93,2.93,0,0,0-2.11-.88A3,3,0,0,0,4,5.73L2.64,7.08A6.37,6.37,0,0,0,1,12.33c.32,3.75,2.78,8.26,6.57,12.06s8.35,6.25,12.1,6.61a7.87,7.87,0,0,0,.84,0,6.07,6.07,0,0,0,4.41-1.64L26.27,28a3,3,0,0,0,.88-2.13,2.93,2.93,0,0,0-.88-2.11Zm1.41,5.66L23.5,27.94a4.57,4.57,0,0,1-3.66,1c-3.25-.28-7.39-2.58-10.81-6S3.31,15.41,3,12.16A4.53,4.53,0,0,1,4,8.5L5.41,7.14a1.014,1.014,0,0,1,1.42,0L9.66,10a1,1,0,0,1,0,1.41l-2,2a1,1,0,0,0-.16,1.21,27.49,27.49,0,0,0,4.33,5.58,27.49,27.49,0,0,0,5.58,4.33,1,1,0,0,0,1.21-.16l2-2a1,1,0,0,1,1.41,0l2.83,2.83a.978.978,0,0,1,0,1.39Z" fill="#fff"/><path d="M20.09,31.261c-.144,0-.29,0-.433-.012h-.011c-3.87-.372-8.45-2.87-12.253-6.682C3.561,20.725,1.079,16.161.752,12.359A6.59,6.59,0,0,1,2.457,6.91L2.464,6.9l1.36-1.35a3.228,3.228,0,0,1,2.3-.953h.024a3.2,3.2,0,0,1,2.272.955l2.828,2.818a3.25,3.25,0,0,1,0,4.6L9.939,14.284a26.417,26.417,0,0,0,3.478,4.3,25.937,25.937,0,0,0,4.3,3.478l1.308-1.308a3.25,3.25,0,0,1,4.6,0l2.82,2.83a3.2,3.2,0,0,1,.953,2.288,3.27,3.27,0,0,1-.953,2.305l-1.356,1.365a6.3,6.3,0,0,1-4.326,1.713c-.085,0-.169,0-.254-.005C20.372,31.258,20.23,31.261,20.09,31.261Zm-.4-.511a7.662,7.662,0,0,0,.808,0h.024c.081,0,.163.005.244.005a5.8,5.8,0,0,0,3.981-1.575l1.347-1.357a2.769,2.769,0,0,0,.807-1.953,2.7,2.7,0,0,0-.8-1.932l-2.822-2.832a2.75,2.75,0,0,0-3.9,0L17.785,22.7l-.169-.107a26.433,26.433,0,0,1-4.553-3.655,26.914,26.914,0,0,1-3.654-4.552L9.3,14.215l1.592-1.592a2.75,2.75,0,0,0,0-3.9l-2.83-2.82A2.7,2.7,0,0,0,6.147,5.1H6.123a2.732,2.732,0,0,0-1.946.807L2.82,7.254a6.093,6.093,0,0,0-1.572,5.04l0,.015c.315,3.691,2.744,8.141,6.5,11.9C11.469,27.945,15.932,30.388,19.689,30.751Zm.885-1.5a4.835,4.835,0,0,1-.765-.061c-3.3-.288-7.5-2.614-10.956-6.071s-5.784-7.632-6.1-10.924A4.773,4.773,0,0,1,3.809,8.339l.018-.019,1.41-1.36a1.24,1.24,0,0,1,.878-.36h.012a1.242,1.242,0,0,1,.88.363L9.838,9.824a1.253,1.253,0,0,1,0,1.762l-2,2a.751.751,0,0,0-.12.908,27.251,27.251,0,0,0,4.29,5.528,27.257,27.257,0,0,0,5.53,4.292.75.75,0,0,0,.906-.121l2-2a1.25,1.25,0,0,1,1.763,0l2.831,2.831a1.228,1.228,0,0,1,0,1.743L23.66,28.132A4.829,4.829,0,0,1,20.574,29.249ZM4.183,8.671a4.274,4.274,0,0,0-.937,3.448l0,.017c.3,3.184,2.587,7.256,5.958,10.627s7.464,5.653,10.655,5.928l.019,0a4.319,4.319,0,0,0,3.452-.938l1.352-1.342a.728.728,0,0,0,0-1.037l-2.829-2.829a.75.75,0,0,0-1.057,0l-2,2a1.25,1.25,0,0,1-1.512.2,27.757,27.757,0,0,1-5.632-4.37,27.751,27.751,0,0,1-4.368-5.63,1.251,1.251,0,0,1,.2-1.514l2-2a.752.752,0,0,0,0-1.057l-2.83-2.86A.744.744,0,0,0,6.126,7.1H6.114a.745.745,0,0,0-.528.218Z" fill="#07abf3"/><path d="M26.6,5.39A14.92,14.92,0,0,0,16,1a1,1,0,0,0,0,2A13,13,0,0,1,29,16.11a1,1,0,1,0,2,0A14.91,14.91,0,0,0,26.6,5.39Z" fill="#fff"/><path d="M16.03.75A15.23,15.23,0,0,1,31.25,16.112a1.25,1.25,0,0,1-2.5,0A12.75,12.75,0,0,0,16,3.25a1.25,1.25,0,1,1,0-2.5ZM30,16.86a.751.751,0,0,0,.75-.75A14.756,14.756,0,0,0,16.03,1.25H16a.75.75,0,1,0,0,1.5A13.25,13.25,0,0,1,29.25,16.112.75.75,0,0,0,30,16.86Z" fill="#07abf3"/><path d="M20.91,11.11a6,6,0,0,1,1.77,4.31,1,1,0,0,0,2,0,8,8,0,0,0-8-8.1,1,1,0,0,0,0,2,6,6,0,0,1,4.23,1.79Z" fill="#fff"/><path d="M16.68,7.07h0a8.25,8.25,0,0,1,8.25,8.353,1.25,1.25,0,0,1-2.5,0,5.784,5.784,0,0,0-1.7-4.133A5.714,5.714,0,0,0,16.678,9.57a1.25,1.25,0,0,1,0-2.5Zm7,9.1a.751.751,0,0,0,.75-.75,7.75,7.75,0,0,0-7.75-7.85h0a.75.75,0,1,0,0,1.5,6.21,6.21,0,0,1,4.408,1.865,6.284,6.284,0,0,1,1.842,4.488A.75.75,0,0,0,23.68,16.17Z" fill="#07abf3"/></g></g></svg>
							</div>
						</div>
						<div class="col-7 text-left clr-db">
							<p class="ff-rb text-uppercase fz-18x">Телефон</p>
							<p class="ff-rl">+359 123 456</p>
							<p class="ff-rl">+359 123 457</p>
						</div>
					</div>
				</div>
				<div class="col-md-4 col-12 text-center clr-db">
					<div class="row">
						<div class="col-5 text-right pr-0 clr-db">
							<div class="mb-1">
								<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50"><g transform="translate(-1058 -947)"><circle cx="25" cy="25" r="25" transform="translate(1058 947)" fill="#07abf3"/><g transform="translate(1069 961)"><path d="M25.451,61h-23A2.457,2.457,0,0,0,0,63.452V79.8a2.456,2.456,0,0,0,2.452,2.452h23A2.456,2.456,0,0,0,27.9,79.8V63.452A2.456,2.456,0,0,0,25.451,61Zm-.339,1.635L14,73.744,2.8,62.635ZM1.635,79.464V63.783L9.509,71.59ZM2.791,80.62l7.879-7.879,2.761,2.737a.817.817,0,0,0,1.154,0l2.692-2.692,7.836,7.836Zm23.478-1.156-7.836-7.836,7.836-7.836Z" transform="translate(0 -61)" fill="#fff"/></g></g></svg>
							</div>
						</div>
						<div class="col-7 text-left clr-db">
							<p class="ff-rb text-uppercase fz-18x">Имейл</p>
							<p class="ff-rl">email@email.com</p>
							<p class="ff-rl">admin@email.bg</p>
						</div>
					</div>
				</div>
			</div>
		</div>
	</section>
	<?php
}
	?>
